//======================================================
//
// item_paint.cpp
// Author : 髙野馨將
//
//======================================================
#include "Item_Paint.h"
#include "Texture.h"

//======================================================
//コンストラクタ
//======================================================
CPaint::CPaint(int nPriority) : CItem(nPriority)
{
}

//======================================================
//デストラクタ
//======================================================
CPaint::~CPaint()
{
}

//======================================================
//初期化処理
//======================================================
HRESULT CPaint::Init(void)
{
	//初期化
	CItem::Init();

	//テクスチャ設定
	SetTextureKey("SKILL_ICON_PEINT");

	return S_OK;
}

//======================================================
//更新処理
//======================================================
void CPaint::Update(void)
{
	//更新
	CItem::Update();
}

//======================================================
//生成処理
//======================================================
CPaint *CPaint::Create(const D3DXVECTOR3 pos)
{
	//動的確保
	CPaint *pPaint = new CPaint;

	if (pPaint != nullptr)
	{
		//情報の設定
		pPaint->Init();
		pPaint->SetPos(pos);
		pPaint->SetEffect(PAINT);
	}

	return pPaint;
}