//======================================================
//
// item_bom.cpp
// Author : 髙野馨將
//
//======================================================
#include "Item_Bom.h"
#include "Texture.h"
#include "Block.h"
#include "Game.h"
#include "Map.h"

//======================================================
//コンストラクタ
//======================================================
CBom::CBom(int nPriority) : CItem(nPriority)
{
}

//======================================================
//デストラクタ
//======================================================
CBom::~CBom()
{
}

//======================================================
//初期化処理
//======================================================
HRESULT CBom::Init(void)
{
	//初期化
	CItem::Init();

	//テクスチャ設定
	SetTextureKey("SKILL_ICON_BOMB");

	return S_OK;
}

//======================================================
//更新処理
//======================================================
void CBom::Update(void)
{
	//更新
	CItem::Update();
}

//======================================================
//アイテム生成処理
//======================================================
CBom *CBom::Create(const D3DXVECTOR3 pos)
{
	//動的確保
	CBom *pBom = new CBom;

	if (pBom != nullptr)
	{
		//情報の設定
		pBom->Init();
		pBom->SetPos(pos);
		pBom->SetEffect(BOM);
	}

	return pBom;
}